Found 388 images belonging to 4 classes.
VGG16 Summary:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
predictions (Dense)          (None, 1000)              4097000   
=================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 4096)              102764544 
_________________________________________________________________
fc2 (Dense)                  (None, 4096)              16781312  
_________________________________________________________________
predictions (Dense)          (None, 1000)              4097000   
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 4004      
=================================================================
Total params: 138,361,548
Trainable params: 4,004
Non-trainable params: 138,357,544
_________________________________________________________________
Found 32 images belonging to 4 classes.
Found 0 images belonging to 4 classes.
Epoch 1/5

1/5 [=====>........................] - ETA: 1:16 - loss: 1.3823 - acc: 0.8000
2/5 [===========>..................] - ETA: 29s - loss: 1.3825 - acc: 0.8000 
3/5 [=================>............] - ETA: 13s - loss: 1.3833 - acc: 0.6667
4/5 [=======================>......] - ETA: 5s - loss: 1.3838 - acc: 0.5500 
5/5 [==============================] - 26s 5s/step - loss: 1.3840 - acc: 0.5200 - val_loss: 1.3865 - val_acc: 0.2500
Epoch 2/5

1/5 [=====>........................] - ETA: 1s - loss: 1.3851 - acc: 0.2000
2/5 [===========>..................] - ETA: 1s - loss: 1.3849 - acc: 0.2000
3/5 [=================>............] - ETA: 0s - loss: 1.3857 - acc: 0.2000
4/5 [=======================>......] - ETA: 0s - loss: 1.3859 - acc: 0.1500
5/5 [==============================] - 3s 540ms/step - loss: 1.3856 - acc: 0.1600 - val_loss: 1.3855 - val_acc: 0.2500
Epoch 3/5

1/5 [=====>........................] - ETA: 1s - loss: 1.3856 - acc: 0.4000
2/5 [===========>..................] - ETA: 1s - loss: 1.3853 - acc: 0.4000
3/5 [=================>............] - ETA: 0s - loss: 1.3856 - acc: 0.3333
4/5 [=======================>......] - ETA: 0s - loss: 1.3851 - acc: 0.4000
5/5 [==============================] - 3s 540ms/step - loss: 1.3853 - acc: 0.4000 - val_loss: 1.3867 - val_acc: 0.1250
Epoch 4/5

1/5 [=====>........................] - ETA: 1s - loss: 1.3851 - acc: 0.4000
2/5 [===========>..................] - ETA: 1s - loss: 1.3849 - acc: 0.3000
3/5 [=================>............] - ETA: 0s - loss: 1.3849 - acc: 0.3333
4/5 [=======================>......] - ETA: 0s - loss: 1.3850 - acc: 0.3500
5/5 [==============================] - 3s 540ms/step - loss: 1.3843 - acc: 0.4000 - val_loss: 1.3856 - val_acc: 0.2500
Epoch 5/5

1/5 [=====>........................] - ETA: 1s - loss: 1.3837 - acc: 0.4000
2/5 [===========>..................] - ETA: 1s - loss: 1.3847 - acc: 0.3000
3/5 [=================>............] - ETA: 0s - loss: 1.3847 - acc: 0.2667
4/5 [=======================>......] - ETA: 0s - loss: 1.3848 - acc: 0.2500
5/5 [==============================] - 3s 541ms/step - loss: 1.3853 - acc: 0.2000 - val_loss: 1.3860 - val_acc: 0.2500
